clusterMHDTest/Cilindro/M2.6/HLLC-Upwind/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1;

boundaryField
{
    front_back      
    {
                type            empty;
      		
    }





    simetria      
    {
               type            zeroGradient;
    }

    Inlet      
	{
		

               type          fixedValue;
		
		value uniform 1;

		

	} 

    outlet          
    {
                type           zeroGradient;
    }

  cilindro
        {
                type           zeroGradient;

        }
}

// ************************************************************************* //
