clusterMHDTest/Cilindro/M2.6/HLLC-Upwind/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
fluxScheme     HLLC;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default          Gauss linear;

}

divSchemes
{
    default      none;  
 
}




laplacianSchemes
{
    default         none;





}

interpolationSchemes
{
    default        upwind;



}

snGradSchemes
{
    default         corrected;
   
}



// ************************************************************************* //
